{
    "tokenizer_class": "GenomicTokenizer",
    "unk_token": "[UNK]",
    "pad_token": "[PAD]",
    "cls_token": "[CLS]",
    "sep_token": "[SEP]",
    "mask_token": "[MASK]",
    "bos_token": "[BOS]",
    "eos_token": "[SEP]",
    "model_max_length": 512,
    "codons": {
        "GCT": 7,
        "GCC": 7,
        "GCA": 7,
        "GCG": 7,
        "TGT": 8,
        "TGC": 8,
        "GAT": 9,
        "GAC": 9,
        "GAA": 10,
        "GAG": 10,
        "TTT": 11,
        "TTC": 11,
        "GGT": 12,
        "GGC": 12,
        "GGA": 12,
        "GGG": 12,
        "CAT": 13,
        "CAC": 13,
        "ATT": 14,
        "ATC": 14,
        "ATA": 14,
        "AAA": 15,
        "AAG": 15,
        "TTA": 16,
        "TTG": 16,
        "CTT": 16,
        "CTC": 16,
        "CTA": 16,
        "CTG": 16,
        "ATG": 2,
        "AAT": 17,
        "AAC": 17,
        "CCT": 18,
        "CCC": 18,
        "CCA": 18,
        "CCG": 18,
        "CAA": 19,
        "CAG": 19,
        "CGT": 20,
        "CGC": 20,
        "CGA": 20,
        "CGG": 20,
        "AGA": 20,
        "AGG": 20,
        "TCT": 21,
        "TCC": 21,
        "TCA": 21,
        "TCG": 21,
        "AGT": 21,
        "AGC": 21,
        "ACT": 22,
        "ACC": 22,
        "ACA": 22,
        "ACG": 22,
        "GTT": 23,
        "GTC": 23,
        "GTA": 23,
        "GTG": 23,
        "TGG": 24,
        "TAT": 25,
        "TAC": 25,
        "TAA": 1,
        "TAG": 1,
        "TGA": 1
    }
}